In [1]:
import pandas as pd
import numpy as np

In [2]:
alunos = ['thiago','maria','pedro',None]
s = pd.Series(alunos)
s

0    thiago
1     maria
2     pedro
3      None
dtype: object

In [3]:
notas = [1,2,1,8]
s = pd.Series(notas)
s

0    1
1    2
2    1
3    8
dtype: int64

In [4]:
notas = [1,2,1,8,None]
s = pd.Series(notas)
s

0    1.0
1    2.0
2    1.0
3    8.0
4    NaN
dtype: float64

In [5]:
alunos_notas = {
    'thiago': 10,
    'pedro': 5,
    'maria': 9
}
s = pd.Series(alunos_notas)
s

thiago    10
pedro      5
maria      9
dtype: int64

In [22]:
for key,value in s.iteritems():
    print(key + ': ' +str(value/100))

thiago: 0.1
pedro: 0.05
maria: 0.09

In [6]:
alunos = ['thiago','maria','pedro']
notas = [10,9,5]
pd.Series(notas, index=alunos)
s

thiago    10
pedro      5
maria      9
dtype: int64

In [7]:
print(s.iloc[2])
print(s[2])
print(s.loc['maria'])
print(s['maria'])

9
9
9
9

In [8]:
total = 0
for nota in s:
    total += nota
print(total/len(s))

8.0

In [9]:
# paralelizada
total = np.sum(s)
print(total/len(s))

8.0

In [10]:
# vamos conferir
numbers = pd.Series(np.random.randint(0,1000,100000))

In [13]:
%%timeit -n 100
# lento
t = 0
for n in numbers:
    t += n
t/len(numbers)

8.71 ms ± 166 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [15]:
%%timeit -n 100
# fast
t = np.sum(numbers)
t/len(numbers)

108 µs ± 10.6 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [23]:
alunos = ['thiago','maria','pedro']
notas = [10,9,5]
s1 = pd.Series(notas, index=alunos)

s2 = pd.Series([7,3], index=['thais','julia'])
s2.append(s1)

thais      7
julia      3
thiago    10
maria      9
pedro      5
dtype: int64

In [25]:
alunos = ['thiago','thiago','maria','pedro']
notas = [10,4,9,5]
s = pd.Series(notas, index=alunos)
s

thiago    10
thiago     4
maria      9
pedro      5
dtype: int64

In [26]:
s.loc['thiago']

thiago    10
thiago     4
dtype: int64

In [54]:
alunos = [
    {
        'nome': 'Thiago',
        'nota': 8
    },
    {
        'nome': 'Pedro',
        'nota': 7
    },
]
df = pd.DataFrame(alunos)
df.head()

     nome  nota
0  Thiago     8
1   Pedro     7

In [55]:
df = pd.DataFrame(alunos, index=['aluno1','aluno2'])
df.head()

          nome  nota
aluno1  Thiago     8
aluno2   Pedro     7

In [56]:
# retorna a linha do aluno 1 como série
df.loc['aluno1'] # é igual á: df.iloc[0]

nome    Thiago
nota         8
Name: aluno1, dtype: object

In [57]:
type(df.loc['aluno1'])

pandas.core.series.Series

In [58]:
type(df.loc[:,'nota'])

pandas.core.series.Series

In [59]:
df['nota'] # ERRADO df.loc['nota'], pois nesse caso é para linhas

aluno1    8
aluno2    7
Name: nota, dtype: int64

In [60]:
df.T.loc['nota']

aluno1    8
aluno2    7
Name: nota, dtype: object

In [61]:
w = df.loc['aluno1']['nota']

In [62]:
w=1

In [63]:
df.loc['aluno1','nota']

8

In [64]:
df

          nome  nota
aluno1  Thiago     8
aluno2   Pedro     7

In [65]:
df.loc['aluno1',['nota','nome']]

nota         8
nome    Thiago
Name: aluno1, dtype: object

In [66]:
df

          nome  nota
aluno1  Thiago     8
aluno2   Pedro     7

In [67]:
df.drop('aluno2')

          nome  nota
aluno1  Thiago     8

In [68]:
df

          nome  nota
aluno1  Thiago     8
aluno2   Pedro     7

In [69]:
df_copy = df.copy()
df.drop('aluno2',inplace=True)

In [70]:
df

          nome  nota
aluno1  Thiago     8

In [71]:
# dropando coluna
df.drop('nota',inplace=True, axis=1) # same as: del df['nota']

In [72]:
df

          nome
aluno1  Thiago

In [74]:
df['nota'] = None

In [75]:
df

          nome  nota
aluno1  Thiago  None